
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_branch_protection.default_branch["hockeymind"] will be created
  + resource "github_branch_protection" "default_branch" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_status_checks {
          + contexts = [
              + "pre-commit",
            ]
          + strict   = true
        }
    }

  # github_repository.repos["hockeymind"] will be created
  + resource "github_repository" "repos" {
      + allow_auto_merge                        = true
      + allow_merge_commit                      = false
      + allow_rebase_merge                      = true
      + allow_squash_merge                      = true
      + allow_update_branch                     = true
      + archived                                = false
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = true
      + description                             = "HockeyMind"
      + etag                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_issues                              = false
      + has_projects                            = false
      + has_wiki                                = false
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = true
      + is_template                             = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "hockeymind"
      + node_id                                 = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + visibility                              = "private"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ repository_names       = {
      + hockeymind            = (known after apply)
        # (18 unchanged attributes hidden)
    }
  ~ repository_urls        = {
      + hockeymind            = (known after apply)
        # (18 unchanged attributes hidden)
    }

<!-- Sticky Pull Request Commentterraform-plan -->